# COGS 118A - Project Checkpoint

# Names

Hopefully your team is at least this good. Obviously you should replace these with your names.

- Pel√©
- Diego Maradonna
- Johan Cruyff
- Roberto Carlos
- Franz Beckenbaur

# Abstract 
This section should be short and clearly stated. It should be a single paragraph <200 words.  It should summarize: 
- what your goal/problem is
- what the data used represents and how they are measured
- what you will be doing with the data
- how performance/success will be measured

# Background

Fill in the background and discuss the kind of prior work that has gone on in this research area here. **Use inline citation** to specify which references support which statements.  You can do that through HTML footnotes (demonstrated here). I used to reccommend Markdown footnotes (google is your friend) because they are simpler but recently I have had some problems with them working for me whereas HTML ones always work so far. So use the method that works for you, but do use inline citations.

Here is an example of inline citation. After government genocide in the 20th century, real birds were replaced with surveillance drones designed to look just like birds<a name="lorenz"></a>[<sup>[1]</sup>](#lorenznote). Use a minimum of 2 or 3 citations, but we prefer more <a name="admonish"></a>[<sup>[2]</sup>](#admonishnote). You need enough citations to fully explain and back up important facts. 

Remeber you are trying to explain why someone would want to answer your question or why your hypothesis is in the form that you've stated.

# Problem Statement

Clearly describe the problem that you are solving. Avoid ambiguous words. The problem described should be well defined and should have at least one ML-relevant potential solution. Additionally, describe the problem thoroughly such that it is clear that the problem is quantifiable (the problem can be expressed in mathematical or logical terms), measurable (the problem can be measured by some metric and clearly observed), and replicable (the problem can be reproduced and occurs more than once).

# Data

UPDATED FROM PROPOSAL!

You should have obtained and cleaned (if necessary) data you will use for this project.

Please give the following infomration for each dataset you are using
- link/reference to obtain it
- description of the size of the dataset (# of variables, # of observations)
- what an observation consists of
- what some critical variables are, how they are represented
- any special handling, transformations, cleaning, etc you have done should be demonstrated here!

# Proposed Solution

In this section, clearly describe a solution to the problem. The solution should be applicable to the project domain and appropriate for the dataset(s) or input(s) given. Provide enough detail (e.g., algorithmic description and/or theoretical properties) to convince us that your solution is applicable. Make sure to describe how the solution will be tested.  

If you know details already, describe how (e.g., library used, function calls) you plan to implement the solution in a way that is reproducible.

If it is appropriate to the problem statement, describe a benchmark model<a name="sota"></a>[<sup>[3]</sup>](#sotanote) against which your solution will be compared.

# Evaluation Metrics

Propose at least one evaluation metric that can be used to quantify the performance of both the benchmark model and the solution model. The evaluation metric(s) you propose should be appropriate given the context of the data, the problem statement, and the intended solution. Describe how the evaluation metric(s) are derived and provide an example of their mathematical representations (if applicable). Complex evaluation metrics should be clearly defined and quantifiable (can be expressed in mathematical or logical terms).

# Preliminary results

NEW SECTION!

Please show any preliminary results you have managed to obtain.

Examples would include:
- Analyzing the suitability of a dataset or alogrithm for prediction/solving your problem  #we will explain this part
- Performing feature selection or hand-designing features from the raw data. Describe the features available/created and/or show the code for selection/creation #make any nonnumbers into numbers
- Showing the performance of a base model/hyper-parameter setting.  Solve the task with one "default" algorithm and characterize the performance level of that base model. #refer below for all of this
- Learning curves or validation curves for a particular model
- Tables/graphs showing the performance of different models/hyper-parameters

This dataset is extremely suited for this problem since it has a column which is Status which tells based on the previous columns whether or not the credit card request was approved. This was also a dataset of over 10,000 datapoints which is good for our algorithm

In [17]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns    
from matplotlib.pyplot import figure
import sklearn
import numpy as np
import matplotlib.pyplot as plt
from scipy import stats
# use seaborn plotting defaults
import seaborn as sns; sns.set()
from sklearn.datasets import make_blobs

import matplotlib.pyplot as plt
from sklearn.datasets import make_classification
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.tree import DecisionTreeClassifier
from sklearn.svm import SVC
from sklearn.neighbors import KNeighborsClassifier
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import accuracy_score, confusion_matrix, classification_report

#models importing
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split
from sklearn.naive_bayes import GaussianNB 

#linear svm stuff
from sklearn.svm import LinearSVC
from sklearn.pipeline import make_pipeline
from sklearn.preprocessing import StandardScaler
from sklearn.datasets import make_classification

from sklearn.kernel_ridge import KernelRidge

In [18]:
credit  = pd.read_csv('Application_Data.csv')
credit.head()

,Applicant_ID,Applicant_Gender,Owned_Car,Owned_Realty,Total_Children,Total_Income,Income_Type,Education_Type,Family_Status,Housing_Type,...,Owned_Work_Phone,Owned_Phone,Owned_Email,Job_Title,Total_Family_Members,Applicant_Age,Years_of_Working,Total_Bad_Debt,Total_Good_Debt,Status
0,5008806,M,1,1,0,112500,Working ...,Secondary / secondary special ...,Married ...,House / apartment ...,...,0,0,0,Security staff ...,2,59,4,0,30,1
1,5008808,F,0,1,0,270000,Commercial associate ...,Secondary / secondary special ...,Single / not married ...,House / apartment ...,...,0,1,1,Sales staff ...,1,53,9,0,5,1
2,5008809,F,0,1,0,270000,Commercial associate ...,Secondary / secondary special ...,Single / not married ...,House / apartment ...,...,0,1,1,Sales staff ...,1,53,9,0,5,1
3,5008810,F,0,1,0,270000,Commercial associate ...,Secondary / secondary special ...,Single / not married ...,House / apartment ...,...,0,1,1,Sales staff ...,1,53,9,0,27,1
4,5008811,F,0,1,0,270000,Commercial associate ...,Secondary / secondary special ...,Single / not married ...,House / apartment ...,...,0,1,1,Sales staff ...,1,53,9,0,39,1

In [19]:
credit.dtypes

Applicant_ID             int64
Applicant_Gender        object
Owned_Car                int64
Owned_Realty             int64
Total_Children           int64
Total_Income             int64
Income_Type             object
Education_Type          object
Family_Status           object
Housing_Type            object
Owned_Mobile_Phone       int64
Owned_Work_Phone         int64
Owned_Phone              int64
Owned_Email              int64
Job_Title               object
Total_Family_Members     int64
Applicant_Age            int64
Years_of_Working         int64
Total_Bad_Debt           int64
Total_Good_Debt          int64
Status                   int64
dtype: object

In [20]:
#first we will only keep columns that we need. These columns are covered under Data along with status which says whether or not it was approved
credit = credit[["Applicant_Gender", "Applicant_Age","Owned_Realty","Total_Children", "Owned_Car", "Total_Income", "Housing_Type", "Total_Family_Members", "Education_Type", "Family_Status", 'Status']]

In [21]:
credit.head()

,Applicant_Gender,Applicant_Age,Owned_Realty,Total_Children,Owned_Car,Total_Income,Housing_Type,Total_Family_Members,Education_Type,Family_Status
0,M,59,1,0,1,112500,House / apartment ...,2,Secondary / secondary special ...,Married ...
1,F,53,1,0,0,270000,House / apartment ...,1,Secondary / secondary special ...,Single / not married ...
2,F,53,1,0,0,270000,House / apartment ...,1,Secondary / secondary special ...,Single / not married ...
3,F,53,1,0,0,270000,House / apartment ...,1,Secondary / secondary special ...,Single / not married ...
4,F,53,1,0,0,270000,House / apartment ...,1,Secondary / secondary special ...,Single / not married ...

In [22]:
print(len(credit.dtypes)) #same as the number of columns in data

10

In [23]:
#next we check for nulls and nans and if there exists any we will count them
#and decide to drop the row containing that datapooint

credit.isnull().values.any()
#so there isnt any nan values so we dont need to replace any values anywhere

False

In [24]:
#next is making all columns which arent numerical numerical
#first we will check which columns arent numerical
credit.dtypes

Applicant_Gender        object
Applicant_Age            int64
Owned_Realty             int64
Total_Children           int64
Owned_Car                int64
Total_Income             int64
Housing_Type            object
Total_Family_Members     int64
Education_Type          object
Family_Status           object
dtype: object

In [25]:
#from the above we see that Applicant_Gender , Housing_Type , Education_Type , Family_Status
#check the unique values for applicant_gender
credit['Applicant_Gender'].unique()
#from below we see that its male or female

array(['M      ', 'F      '], dtype=object)

In [29]:
#replace M = 1, F = 0
credit['Applicant_Gender'] = credit['Applicant_Gender'].replace(['M      ', 'F      '], [1, 0])
credit.head()

,Applicant_Gender,Applicant_Age,Owned_Realty,Total_Children,Owned_Car,Total_Income,Housing_Type,Total_Family_Members,Education_Type,Family_Status
0,1,59,1,0,1,112500,House / apartment ...,2,Secondary / secondary special ...,Married ...
1,0,53,1,0,0,270000,House / apartment ...,1,Secondary / secondary special ...,Single / not married ...
2,0,53,1,0,0,270000,House / apartment ...,1,Secondary / secondary special ...,Single / not married ...
3,0,53,1,0,0,270000,House / apartment ...,1,Secondary / secondary special ...,Single / not married ...
4,0,53,1,0,0,270000,House / apartment ...,1,Secondary / secondary special ...,Single / not married ...

In [30]:
#do the same as above for Housing_Type
credit['Housing_Type'].unique()

array(['House / apartment                                 ',
       'Rented apartment                                  ',
       'Municipal apartment                               ',
       'With parents                                      ',
       'Co-op apartment                                   ',
       'Office apartment                                  '], dtype=object)

In [31]:
'''
replace as below
['House / apartment                                 ', = 0
       'Rented apartment                                  ' = 1,
       'Municipal apartment                               ' = 2,
       'With parents                                      ' = 3,
       'Co-op apartment                                   ' = 4,
       'Office apartment                                  ' = 5]

'''
credit['Housing_Type'] = credit['Housing_Type'].replace(['House / apartment                                 ',
       'Rented apartment                                  ',
       'Municipal apartment                               ',
       'With parents                                      ',
       'Co-op apartment                                   ',
       'Office apartment                                  '], [0, 1, 2, 3, 4, 5])
credit.head()

,Applicant_Gender,Applicant_Age,Owned_Realty,Total_Children,Owned_Car,Total_Income,Housing_Type,Total_Family_Members,Education_Type,Family_Status
0,1,59,1,0,1,112500,0,2,Secondary / secondary special ...,Married ...
1,0,53,1,0,0,270000,0,1,Secondary / secondary special ...,Single / not married ...
2,0,53,1,0,0,270000,0,1,Secondary / secondary special ...,Single / not married ...
3,0,53,1,0,0,270000,0,1,Secondary / secondary special ...,Single / not married ...
4,0,53,1,0,0,270000,0,1,Secondary / secondary special ...,Single / not married ...

In [33]:
credit['Housing_Type'].unique() #making sure it worked

array([0, 1, 2, 3, 4, 5], dtype=int64)

In [34]:
#next is Education_Type
credit['Education_Type'].unique()

array(['Secondary / secondary special                     ',
       'Higher education                                  ',
       'Incomplete higher                                 ',
       'Lower secondary                                   ',
       'Academic degree                                   '], dtype=object)

In [35]:
'''
Replace as below
['Secondary / secondary special                     ' = 0,
       'Higher education                                  ' = 1,
       'Incomplete higher                                 ' = 2,
       'Lower secondary                                   ' =3,
       'Academic degree                                   ' =4]
'''

credit['Education_Type'] = credit['Education_Type'].replace(['Secondary / secondary special                     ',
       'Higher education                                  ',
       'Incomplete higher                                 ',
       'Lower secondary                                   ',
       'Academic degree                                   '], [0, 1, 2, 3, 4])
credit.head()

,Applicant_Gender,Applicant_Age,Owned_Realty,Total_Children,Owned_Car,Total_Income,Housing_Type,Total_Family_Members,Education_Type,Family_Status
0,1,59,1,0,1,112500,0,2,0,Married ...
1,0,53,1,0,0,270000,0,1,0,Single / not married ...
2,0,53,1,0,0,270000,0,1,0,Single / not married ...
3,0,53,1,0,0,270000,0,1,0,Single / not married ...
4,0,53,1,0,0,270000,0,1,0,Single / not married ...

In [36]:
#check to make sure it worked
credit['Education_Type'].unique()

array([0, 1, 2, 3, 4], dtype=int64)

In [37]:
#next is Family_Status
credit['Family_Status'].unique()

array(['Married                                           ',
       'Single / not married                              ',
       'Civil marriage                                    ',
       'Separated                                         ',
       'Widow                                             '], dtype=object)

In [38]:
'''
Replace as below
['Married                                           ' = 0,
       'Single / not married                              ' = 1,
       'Civil marriage                                    ' = 2,
       'Separated                                         ' = 3,
       'Widow                                             ' = 4]


'''

credit['Family_Status'] = credit['Family_Status'].replace(['Married                                           ',
       'Single / not married                              ',
       'Civil marriage                                    ',
       'Separated                                         ',
       'Widow                                             '], [0,1,2,3,4])
credit.head()

,Applicant_Gender,Applicant_Age,Owned_Realty,Total_Children,Owned_Car,Total_Income,Housing_Type,Total_Family_Members,Education_Type,Family_Status
0,1,59,1,0,1,112500,0,2,0,0
1,0,53,1,0,0,270000,0,1,0,1
2,0,53,1,0,0,270000,0,1,0,1
3,0,53,1,0,0,270000,0,1,0,1
4,0,53,1,0,0,270000,0,1,0,1

In [39]:
credit['Family_Status'].unique()

array([0, 1, 2, 3, 4], dtype=int64)

In [40]:
#all replacement is done here is the  new head
credit.head()

,Applicant_Gender,Applicant_Age,Owned_Realty,Total_Children,Owned_Car,Total_Income,Housing_Type,Total_Family_Members,Education_Type,Family_Status
0,1,59,1,0,1,112500,0,2,0,0
1,0,53,1,0,0,270000,0,1,0,1
2,0,53,1,0,0,270000,0,1,0,1
3,0,53,1,0,0,270000,0,1,0,1
4,0,53,1,0,0,270000,0,1,0,1

In [ ]:
#next is visualization

In [ ]:
#Base Model is logistic classifier

In [ ]:
#test on precision, recall and f1 score

In [ ]:
#try logistic regression with l1, l2, and elasticnet penalty

In [ ]:
#test on precision, recall and f1 score and this is to check hyperparameters

In [ ]:
#for the graphs refer to D5 for the ROC curve for logistic regressor

# Ethics & Privacy

If your project has obvious potential concerns with ethics or data privacy discuss that here.  Almost every ML project put into production can have ethical implications if you use your imagination. Use your imagination.

Even if you can't come up with an obvious ethical concern that should be addressed, you should know that a large number of ML projects that go into producation have unintended consequences and ethical problems once in production. How will your team address these issues?

Consider a tool to help you address the potential issues such as https://deon.drivendata.org

# Team Expectations

Put things here that cement how you will interact/communicate as a team, how you will handle conflict and difficulty, how you will handle making decisions and setting goals/schedule, how much work you expect from each other, how you will handle deadlines, etc...
* *Team Expectation 1*
* *Team Expectation 2*
* *Team Expecation 3*
* ...

# Project Timeline Proposal

UPDATE THE PROPOSAL TIMELINE ACCORDING TO WHAT HAS ACTUALLY HAPPENED AND HOW IT HAS EFFECTED YOUR FUTURE PLANS

| Meeting Date  | Meeting Time| Completed Before Meeting  | Discuss at Meeting |
|---|---|---|---|
| 1/20  |  1 PM |  Brainstorm topics/questions (all)  | Determine best form of communication; Discuss and decide on final project topic; discuss hypothesis; begin background research | 
| 1/26  |  10 AM |  Do background research on topic (Pel√©) | Discuss ideal dataset(s) and ethics; draft project proposal | 
| 2/1  | 10 AM  | Edit, finalize, and submit proposal; Search for datasets (Beckenbaur)  | Discuss Wrangling and possible analytical approaches; Assign group members to lead each specific part   |
| 2/14  | 6 PM  | Import & Wrangle Data ,do some EDA (Maradonna) | Review/Edit wrangling/EDA; Discuss Analysis Plan   |
| 2/23  | 12 PM  | Finalize wrangling/EDA; Begin programming for project (Cruyff) | Discuss/edit project code; Complete project |
| 3/13  | 12 PM  | Complete analysis; Draft results/conclusion/discussion (Carlos)| Discuss/edit full project |
| 3/19  | Before 11:59 PM  | NA | Turn in Final Project  |

# Footnotes
<a name="lorenznote"></a>1.[^](#lorenz): Lorenz, T. (9 Dec 2021) Birds Aren‚Äôt Real, or Are They? Inside a Gen Z Conspiracy Theory. *The New York Times*. https://www.nytimes.com/2021/12/09/technology/birds-arent-real-gen-z-misinformation.html<br> 
<a name="admonishnote"></a>2.[^](#admonish): Also refs should be important to the background, not some randomly chosen vaguely related stuff. Include a web link if possible in refs as above.<br>
<a name="sotanote"></a>3.[^](#sota): Perhaps the current state of the art solution such as you see on [Papers with code](https://paperswithcode.com/sota). Or maybe not SOTA, but rather a standard textbook/Kaggle solution to this kind of problem